<?php

/* @var $this yii\web\View */

$this->title = 'Project Euler Task12';
?>
<div class="euler-task1">
    <h1 class="display-4", style="text-align: center">Проект Эйлера</h1>
    <div>
        <a href="/web/euler/tasks">Back to list</a>
    </div>
    <div class="jumbotron text-center bg-transparent">
        <h1 class="display-4">Задача №12</h1>
        <h2>Треугольное число с большим количеством делителей.</h2>
        <p class="lead">


Последовательность треугольных чисел образуется путем сложения натуральных чисел. К примеру, 7-е треугольное число равно 1 + 2 + 3 + 4 + 5 + 6 + 7 = 28. Первые десять треугольных чисел:<br>

1, 3, 6, 10, 15, 21, 28, 36, 45, 55, ...<br>

Перечислим делители первых семи треугольных чисел:<br>

 1: 1<br>
 3: 1, 3<br>
 6: 1, 2, 3, 6<br>
10: 1, 2, 5, 10<br>
15: 1, 3, 5, 15<br>
21: 1, 3, 7, 21<br>
28: 1, 2, 4, 7, 14, 28<br><br>
Как мы видим, 28 - первое треугольное число, у которого более пяти делителей.<br>

Каково первое треугольное число, у которого более пятисот делителей?



</p>

    </div>

    <div class="body-content">
        <?php 
            
        ?>
        

    </div>
</div>
